In [1]:
import pandas as pd
import numpy as np

In [2]:
df_trans = pd.read_csv("KPMG-transactions.csv")
df_adress=pd.read_csv("KPMG_adress.csv")
df_NewCust=pd.read_csv("KPMG_NewCust.csv")
df_dem=pd.read_csv("KPMG_Dem.csv")

# Evaluación de la calidad de datos.

In [3]:
df_trans.head(5)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date,years_sales
0,1,2,2950,25/02/2017,F,Approved,Solex,Standard,medium,medium,$71.49,$53.62,02/12/2012,4
1,2,3,3120,21/05/2017,V,Approved,Trek Bicycles,Standard,medium,large,"$2,091.47",$388.92,03/03/2014,3
2,3,37,402,16/10/2017,F,Approved,OHM Cycles,Standard,low,medium,"$1,793.43",$248.82,20/07/1999,18
3,4,88,3135,31/08/2017,F,Approved,Norco Bicycles,Standard,medium,medium,"$1,198.46",$381.10,16/12/1998,18
4,5,78,787,01/10/2017,V,Approved,Giant Bicycles,Standard,medium,large,"$1,765.30",$709.48,10/08/2015,2

In [4]:
df_adress.head(5)

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [5]:
df_dem.head(5)

,customer_id,first_name,last_name,gender,past_3_Yesears_bike_related_purchases,DOB,job_title,job_industrYes_categorYes,wealth_segment,deceased_indicator,owns_car,tenure,Edad
0,89,Anselm,Gawne,M,46,11/03/2002,Account Executive,Argiculture,High Net Worth,N,No,1,19
1,90,SibYesl,Scholtz,F,67,26/01/2002,Food Chemist,Health,Mass Customer,N,Yes,1,19
2,91,Sorcha,KeYesson,F,76,15/04/2001,Geological Engineer,Manufacturing,High Net Worth,N,No,1,20
3,92,Maribeth,Pristnor,F,25,17/09/2001,Recruiting Manager,Manufacturing,Mass Customer,N,No,1,20
4,93,Nanice,Ellse,F,21,19/11/2001,Desktop Support Technician,IT,Affluent Customer,N,No,1,20

**Tamaño de datos**

In [6]:
df_trans.shape

(20000, 14)

In [7]:
df_adress.shape

(3999, 6)

In [8]:
df_dem.shape

(3912, 13)

**Datos nulos**

In [9]:
df_adress.isnull().sum()

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [10]:
df_dem.isnull().sum()

customer_id                                0
first_name                                 0
last_name                                121
gender                                     0
past_3_Yesears_bike_related_purchases      0
DOB                                        0
job_title                                497
job_industrYes_categorYes                656
wealth_segment                             0
deceased_indicator                         0
owns_car                                   0
tenure                                     0
Edad                                       0
dtype: int64

In [11]:
df_trans.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
years_sales                  0
dtype: int64

In [12]:
df_trans=df_trans.dropna(axis=1)

In [13]:
df_dem=df_dem.dropna(axis=1)

In [14]:
df_adress=df_adress.dropna(axis=1)

In [15]:
df_trans.columns

Index(['transaction_id', 'product_id', 'customer_id', 'transaction_date',
       'order_status', 'list_price', 'years_sales'],
      dtype='object')

In [16]:
df_adress.columns

Index(['customer_id', 'address', 'postcode', 'state', 'country',
       'property_valuation'],
      dtype='object')

In [17]:
df_dem.columns

Index(['customer_id', 'first_name', 'gender',
       'past_3_Yesears_bike_related_purchases', 'DOB', 'wealth_segment',
       'deceased_indicator', 'owns_car', 'tenure', 'Edad'],
      dtype='object')

In [18]:
df_trans.shape

(20000, 7)

In [19]:
df_adress.shape

(3999, 6)

In [20]:
df_dem.shape

(3912, 10)

**Tipo de datos**

In [21]:
df_trans.dtypes

transaction_id       int64
product_id           int64
customer_id          int64
transaction_date    object
order_status        object
list_price          object
years_sales          int64
dtype: object

In [22]:
df_dem.dtypes

customer_id                               int64
first_name                               object
gender                                   object
past_3_Yesears_bike_related_purchases     int64
DOB                                      object
wealth_segment                           object
deceased_indicator                       object
owns_car                                 object
tenure                                    int64
Edad                                      int64
dtype: object

In [23]:
df_adress.dtypes

customer_id            int64
address               object
postcode               int64
state                 object
country               object
property_valuation     int64
dtype: object